Revit 2027 API
Document.GetAllUnusedElements Method
 Returns the list of element ids that are not used. The list of unused element ids may include elements that can't be deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetAllUnusedElements(
	ISet<ElementId> categories
)
Public Function GetAllUnusedElements (
	categories As ISet(Of ElementId)
) As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetAllUnusedElements(
	ISet<ElementId^>^ categories
)
member GetAllUnusedElements :
        categories : ISet<ElementId> -> ISet<ElementId>
Parameters
categories ISet<ElementId>
 Collection of categories to check for unused elements.
Return Value
ISet<ElementId>
 Unused element ids.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 This method returns unused element ids that are available in the Purge Unused window in the Revit, including elements that can't be deleted. To get unused elements that do not have a category assigned add INVALID to the collection of categories. If the input categories collection is empty, the method returns all unused elements in the document.
Example
public void GetAllUnusedElements(Autodesk.Revit.DB.Document document)
{
   // Get all unused elements in the document
   var allUnusedElementIds = document.GetAllUnusedElements(new HashSet<ElementId>());
   // Get unused elements without a category
   var unusedElementIdsWithNoCategory = document.GetAllUnusedElements(new HashSet<ElementId>() { new ElementId(BuiltInCategory.INVALID) });
   // Get unused wall and floors types
   HashSet<ElementId> categoriesToPurge = new HashSet<ElementId>
   {
      new ElementId(BuiltInCategory.OST_Walls),
      new ElementId(BuiltInCategory.OST_Floors)
   };
   var unusedElementIds = document.GetAllUnusedElements(categoriesToPurge);
}
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace